m = int(input('Начнем? 1 да , 2 нет, 3 я подумаю:'))
if m == 1 :
    print('пизда, иди пивка попей')

if m == 2:
    print('НЕТ??? ну и пошел науй тогда...... Пидр!')
if m == 3:
    print('Вот и правильно, думать полезно.')
if m <= 4:
    print('ТЫ ТУПОЙ???? 1,2 или 3 надо написать')
n =str(input('Кто тебе больше нравится: девушки или парни?'))
if n == str('девушки'):
    print('Ну конечно, ну если честно между нами то это полное пидорство')
if n == str('парни'):
    print('Я так и знал что нормальный парень')
else:
    print('Еще раз ты попрубуешь повыебываться и я сожгу твой комп к хуям')
b = int(input('хочешь пойти со мной в зал? 1 да , 2 нет, 3 смотря сколько стоит абонемент'))
if b == 1:
    print('Вот и хорошо, я позвоню тебе на simens')
if b == 2:
    print('Да ладно тебе у нас есть dungeon master')
if b == 3:
    print('three hundred bucks ')